_posts/2014-09-22-postgresql-cert-auth.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 设置CA</a>
<ul>
<li><a href="#sec-1-1">1.1. 产生CA私钥</a></li>
<li><a href="#sec-1-2">1.2. 产生CA证书</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 设置 PostgreSQL 服务器</a>
<ul>
<li><a href="#sec-2-1">2.1. 准备数据目录</a></li>
<li><a href="#sec-2-2">2.2. 生成PostgreSQL服务器端私钥</a></li>
<li><a href="#sec-2-3">2.3. 作用CA签名生成PostgreSQL服务器端证书</a></li>
<li><a href="#sec-2-4">2.4. CA的证书和服务器端证书加到 root.crt</a></li>
<li><a href="#sec-2-5">2.5. 设置PostgreSQL服务器端授权访问规则</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 设置PostgreSQL客户端</a>
<ul>
<li><a href="#sec-3-1">3.1. 拷贝服务器端根证书</a></li>
<li><a href="#sec-3-2">3.2. 生成客户端私钥</a></li>
<li><a href="#sec-3-3">3.3. 生成经过CA签名的证书</a></li>
<li><a href="#sec-3-4">3.4. 访问数据库</a></li>
</ul>
</li>
</ul>
</div>
</div>
---
layout: post
title: 在PostgreSQL中使用证书进行登陆验证
category: PostgreSQL
---

<p>
PostgreSQL支持多种<a href="http://www.postgresql.org/docs/devel/static/client-authentication.html">验证方式</a> ，其中证书验证需要在<a href="http://www.postgresql.org/docs/devel/static/ssl-tcp.html">启用SSL</a> , SSL本身的设置
就很麻烦，本文深度参考文后的参考页面，讲述从制作CA证书到完成用户的基于
证书的认证的过程。
</p>

<p>
新建目录/tmp/cert，以下所有操作都在该用户下进行。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 设置CA</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 产生CA私钥</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-sh">openssl genrsa -des3 -out trustly-ca.key 2048
chmod 400 trustly-ca.key
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 产生CA证书</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-sh">openssl req -new -x509 -days 3650 <span style="color: #ffc1c1;">\</span>
-subj <span style="color: #ffc1c1;">'/C=SE/ST=Stockholm/L=Stockholm/O=Trustly/CN=trustly'</span> 
-key trustly-ca.key -out trustly-ca.crt
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 设置 PostgreSQL 服务器</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 准备数据目录</h3>
<div class="outline-text-3" id="text-2-1">
<p>
始化PostgreSQL数据目录在/tmp/cert/data下，然后编辑配置文件打开如下选项：
</p>

<div class="org-src-container">

<pre class="src src-conf"><span style="color: #7fffd4;">ssl</span> = on
<span style="color: #7fffd4;">ssl_cert_file</span> = <span style="color: #ffc1c1;">'server.crt'</span>
<span style="color: #7fffd4;">ssl_key_file</span> = <span style="color: #ffc1c1;">'server.key'</span>
<span style="color: #7fffd4;">ssl_ca_file</span> = <span style="color: #ffc1c1;">'root.crt'</span>
</pre>
</div>
<p>
下面我们就来产生以上配置需要的文件。
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 生成PostgreSQL服务器端私钥</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">&#29983;&#25104;&#31169;&#38053;</span>
openssl genrsa -des3 -out data/server.key 2048
<span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">&#31227;&#38500;&#23494;&#30721;</span>
openssl rsa -in data/server.key -out data/server.key
chmod 400 data/server.key
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 作用CA签名生成PostgreSQL服务器端证书</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">&#29983;&#25104;&#31614;&#21517;&#35831;&#27714;</span>
openssl req -new -nodes -key data/server.key -days 3650 <span style="color: #ffc1c1;">\</span>
-out server.csr -subj <span style="color: #ffc1c1;">'/C=SE/ST=Stockholm/L=Stockholm/O=Trustly/CN=postgres'</span>
<span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">&#20351;&#29992;CA&#30340;&#31169;&#38053;&#31614;&#21517;</span>
openssl x509 -days 3650 -req -in server.csr -CA trustly-ca.crt <span style="color: #ffc1c1;">\</span>
-CAkey trustly-ca.key -CAcreateserial -out data/server.crt
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> CA的证书和服务器端证书加到 root.crt</h3>
<div class="outline-text-3" id="text-2-4">
<p>
本步使所有CA签名的证书都可以通过服务器端验证
</p>
<div class="org-src-container">

<pre class="src src-sh">cat data/server.crt trustly-ca.pem &gt; data/root.crt
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 设置PostgreSQL服务器端授权访问规则</h3>
<div class="outline-text-3" id="text-2-5">
<p>
启动PostgreSQL 登陆，执行SQL:
</p>
<div class="org-src-container">

<pre class="src src-sql"><span style="color: #00ffff;">CREATE</span> <span style="color: #00ffff;">GROUP</span> sslcertusers;
<span style="color: #b0c4de;">ALTER</span> <span style="color: #00ffff;">GROUP</span> sslcertusers <span style="color: #b0c4de;">ADD</span> <span style="color: #00ffff;">USER</span> swida;
</pre>
</div>
<p>
在pg\<sub>hba</sub>.conf中加入：
</p>

<pre class="example">
hostssl mydatabase +sslcertusers 192.168.1.0/24 cert
# 重新装载配置文件
pg_ctl reload -D data
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 设置PostgreSQL客户端</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 拷贝服务器端根证书</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh">cp data/root.crt root.crt
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 生成客户端私钥</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-sh">openssl genrsa -des3 -out postgresql.key 1024
<span style="color: #fa8072;"># </span><span style="color: #ff7f24; font-style: italic;">&#22914;&#26524;&#38656;&#35201;&#21487;&#20197;&#31227;&#38500;&#23494;&#30721;</span>
openssl rsa -in postgresql.key -out postgresql.key
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 生成经过CA签名的证书</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-sh">openssl req -new -key postgresql.key -out postgresql.csr <span style="color: #ffc1c1;">\</span>
-subj <span style="color: #ffc1c1;">'/C=SE/ST=Stockholm/L=Stockholm/O=Trustly/CN=swida'</span>
openssl x509 -req -in postgresql.csr -CA trustly-ca.pem -CAkey trustly-ca.key <span style="color: #ffc1c1;">\</span>
-out postgresql.crt -CAcreateserial
chmod 400 postgresql.key
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 访问数据库</h3>
<div class="outline-text-3" id="text-3-4">
<p>
使用下列命令访问数据库应该不需要密码
</p>
<div class="org-src-container">

<pre class="src src-sh">psql -Uswida -h host -d <span style="color: #ffc1c1;">"dbname=postgres sslmode=require sslcert=postgresql.crt sslkey=postgresql.key"</span>
</pre>
</div>
<p>
可能将以上文件：postgresql.key, postgresql.crt, root.crt拷贝到
~/.postgresql/目录上，不需要指定sslcert和sslkey即可访问。
</p>

<p>
参考：<a href="http://joelonsql.com/2013/04/27/securing-postgresql-using-hostssl-cert-clientcert1/">http://joelonsql.com/2013/04/27/securing-postgresql-using-hostssl-cert-clientcert1/</a>
</p>
</div>
</div>
</div>
